renfernand/OWSNRIT/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
#include "board.h"
#include "stdio.h"
#include <string.h>
#include "hw_ioc.h"             // Access to IOC register defines
#include "hw_ssi.h"             // Access to SSI register defines
#include "hw_sys_ctrl.h"        // Clocking control
#include "hw_memmap.h"
#include "ioc.h"                // Access to driverlib ioc fns
#include "gpio.h"               // Access to driverlib gpio fns
#include "osens.h"
#include "osens_itf.h"
#include "opentimers.h"
#include "scheduler.h"
#include "board.h"
#include "sys_ctrl.h"
#include "osens_itf_mote.h"
#include "uarthal.h"
#include "leds.h"
#include "uart.h"
#include "debugpins.h"
#include "IEEE802154RIT.h"
#if MYLINKXS_SENSORS
#include "mylinkxs.h"
#if SONOMA14
#include <math.h>
#endif
#if SENSOR_ACCEL
#include "acc_bma250.h"
#endif
#endif
#define TRACE_ON 0

// minimum tick time is 1
#define MS2TICK(ms) (ms) > OSENS_SM_TICK_MS ? (ms) / OSENS_SM_TICK_MS : 1

#define DBG_READ  0
#define DBG_WRITE 1

#if (MYLINKXS_REMOTE_CONTROL == 1)
uint8_t flagwriteenable=0;
void simula_envio_cmd(osens_point_t *pt);

#endif


#if (SONOMA14 == 1)
//enderecos SONOMA
#define SONOMA_ADDR_CMD        0x00
#define SONOMA_ADDR_FWDATE     0x01
#define SONOMA_ADDR_SAMPLES    0x08     //DEFAULT 400
#define SONOMA_ADDR_S0_GAIN    0x0D
#define SONOMA_ADDR_S1_GAIN    0x0C
#define SONOMA_ADDR_S2_GAIN    0x0F
#define SONOMA_ADDR_S3_GAIN    0x0E
#define SONOMA_ADDR_S0_OFFSET  0x10
#define SONOMA_ADDR_S2_OFFSET  0x11
#define SONOMA_ADDR_S1_OFFSET  0x12
#define SONOMA_ADDR_S3_OFFSET  0x13
#define SONOMA_ADDR_T_GAIN     0x14
#define SONOMA_ADDR_T_OFFSET   0x15
#define SONOMA_ADDR_VA_RMS	   0x2B	// [S.23] RMS Voltage for VA source
#define SONOMA_ADDR_IA_RMS	   0x3E	// [S.23] RMS Current for IA source
#define SONOMA_ADDR_WATT_A	   0x4B	// [S.23] Active Power for VA source
#define SONOMA_ADDR_UART_BAUD  0xB1  //UART Baudrate 9600

// Ajuste para os valores recebidos pela SONOMA
#define SONOMA_TRIMER_VA_RMS	   1  // 0.0015	// [S.23]
#define SONOMA_TRIMER_IA_RMS	   1  //0.0015	// [S.23] (NÃO CONFERIDO)
#define SONOMA_TRIMER_WATT_A	   1  // 0.0015	// [S.23] (NÃO CONFERIDO)

uint32_t CalculaInt(uint8_t rx[]);
float CalculaS23(uint8_t *rx);
float CalculaS21(uint8_t *rx);
float CalculaSType(uint8_t *paux, int stype);


#endif


enum {
    OSENS_STATE_INIT = 0,
    OSENS_STATE_SEND_ITF_VER = 1,
    OSENS_STATE_WAIT_ITF_VER_ANS = 2,
    OSENS_STATE_PROC_ITF_VER = 3,
    OSENS_STATE_SEND_BRD_ID = 4,
    OSENS_STATE_WAIT_BRD_ID_ANS = 5,
    OSENS_STATE_PROC_BRD_ID = 6,
    OSENS_STATE_SEND_PT_DESC = 7,
    OSENS_STATE_WAIT_PT_DESC_ANS = 8,
    OSENS_STATE_PROC_PT_DESC = 9,
    OSENS_STATE_BUILD_SCH = 10,
    OSENS_STATE_RUN_SCH = 11,
    OSENS_STATE_SEND_PT_VAL = 12,
    OSENS_STATE_WAIT_PT_VAL_ANS = 13,
    OSENS_STATE_PROC_PT_VAL = 14,
    OSENS_STATE_WR_PT = 15,
    OSENS_STATE_WAIT_WR_PT_ANS = 16,
    OSENS_STATE_PROC_WR_PT_ANS = 17
};

#if TRACE_ON == 1
uint8_t *sm_states_str[] = {
    "INIT",
    "SEND_ITF_VER",
    "WAIT_ITF_VER_ANS",
    "PROC_ITF_VER",
    "SEND_BRD_ID",
    "WAIT_BRD_ID_ANS",
    "PROC_BRD_ID",
    "SEND_PT_DESC",
    "WAIT_PT_DESC_ANS",
    "PROC_PT_DESC",
    "BUILD_SCH",
    "RUN_SCH",
    "SEND_PT_VAL",
    "WAIT_PT_VAL_ANS",
    "PROC_PT_VAL",
    "WR_PT",
    "WAIT_WR_PT_ANS",
    "PROC_WR_PT_ANS"
};
#endif

enum {
	OSENS_STATE_EXEC_OK = 0,
	OSENS_STATE_EXEC_WAIT_OK,
	OSENS_STATE_EXEC_WAIT_STOP,
	OSENS_STATE_EXEC_WAIT_ABORT,
	OSENS_STATE_EXEC_ERROR
};


typedef uint8_t (*osens_mote_sm_func_t)(osens_mote_sm_state_t *st);

typedef struct osens_mote_sm_table_s
{
	osens_mote_sm_func_t func;
	uint8_t next_state;
	uint8_t abort_state; // for indicating timeout or end of cyclic operation
	uint8_t error_state;
} osens_mote_sm_table_t;


typedef struct osens_acq_schedule_s
{
	uint8_t num_of_points;
	struct points_e
	{
		uint8_t index;
		uint32_t sampling_time_x250ms;
        uint32_t counter;
	} points[OSENS_MAX_POINTS];

	struct scan_e
	{
		uint8_t num_of_points;
		uint8_t index[OSENS_MAX_POINTS];
	} scan;

	struct write_e
	{
		uint8_t prod;
		uint8_t cons;
		uint8_t index[OSENS_MAX_POINTS];
	} write;
} osens_acq_schedule_t;

#define PC_INC_QUEUE(v,mv) (((v) + 1) >= (mv)) ? 0 : (v) + 1

static uint8_t osens_mote_sm_func_build_sch(osens_mote_sm_state_t *st);
static uint8_t osens_mote_sm_func_pt_desc_ans(osens_mote_sm_state_t *st);
static uint8_t osens_mote_sm_func_req_pt_desc(osens_mote_sm_state_t *st);
static uint8_t osens_mote_sm_func_run_sch(osens_mote_sm_state_t *st);

const osens_mote_sm_table_t osens_mote_sm_table[];
const uint8_t datatype_sizes[] = { 1, 1, 2, 2, 4, 4, 8, 8, 4, 8 }; // check osens_datatypes_e order

uint8_t num_rx_bytes;
uint8_t tx_data_len;
uint32_t flagErrorOccurred;

uint8_t frame[OSENS_MAX_FRAME_SIZE];

osens_cmd_req_t cmd;
osens_cmd_res_t ans;

osens_mote_sm_state_t sm_state;
osens_point_ctrl_t sensor_points;
osens_brd_id_t board_info;
osens_acq_schedule_t schedule;


//=========================== prototypes =======================================
//=========================== public ==========================================
void sensor_timer(void);

#if (MYLINKXS_LIGHT_CONTROL == 0)
static void osens_mote_tick(void);
#endif

static void buBufFlush(void);
void bspLedToggle(uint8_t ui8Leds);
#if TRACE_ON == 1
static void osens_mote_show_values(void)
{
    uint8_t n;
    OS_UTIL_LOG(1, ("\n"));
    for (n = 0; n < sensor_points.num_of_points; n++)
    {
        switch (sensor_points.points[n].value.type)
        {
        case OSENS_DT_U8:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.u8));
            break;
        case OSENS_DT_S8:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.s8));
            break;
        case OSENS_DT_U16:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.u16));
            break;
        case OSENS_DT_S16:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.s16));
            break;
        case OSENS_DT_U32:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.u32));
            break;
        case OSENS_DT_S32:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.s32));
            break;
        case OSENS_DT_U64:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.u64));
            break;
        case OSENS_DT_S64:
            OS_UTIL_LOG(1, ("Point %02d: %d\n", n, sensor_points.points[n].value.value.s64));
            break;
        case OSENS_DT_FLOAT:
            OS_UTIL_LOG(1, ("Point %02d: %f\n", n, sensor_points.points[n].value.value.fp32));
            break;
        case OSENS_DT_DOUBLE:
            OS_UTIL_LOG(1, ("Point %02d: %f\n", n, sensor_points.points[n].value.value.fp64));
            break;
        default:
            break;
       }
    }
}
#endif








static uint8_t osens_mote_pack_send_frame(osens_cmd_req_t *cmd, uint8_t cmd_size)
{
    uint8_t size;

    size = osens_pack_cmd_req(cmd, frame);

    if (size != cmd_size)
        return OSENS_STATE_EXEC_ERROR;

