renfernand/OWSNRIT/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
    // Push byte from RX FIFO to buffer
    value = UARTCharGetNonBlocking(OSENS_UART_BASE);

    if (num_rx_bytes < OSENS_MAX_FRAME_SIZE)
    	frame[num_rx_bytes] = (uint8_t) value;

    num_rx_bytes++;
    if (num_rx_bytes >= OSENS_MAX_FRAME_SIZE)
        num_rx_bytes = 0;
}


/**************************************************************************//**
* @brief    This function flushes the ringbuffer control structure specified
*           by \e psBuf.
*
* @param    psBuf       is a pointer to a \e tBuBuf ringbuffer structure.
*
* @return   None
******************************************************************************/
static void buBufFlush(void)
{
    // Start of critical section
    bool bIntDisabled = IntMasterDisable();

    num_rx_bytes = 0;

    if(!bIntDisabled)
    {
        IntMasterEnable();
    }
}


void uart1_isr_private(void)
{
    uint32_t ui32IntBm = UARTIntStatus(OSENS_UART_BASE, 1);
    //uint8_t dummy=0;

    UARTIntClear(OSENS_UART_BASE, (ui32IntBm & 0xF0));

    //ERROR LINE
    if (ui32IntBm & (UART_INT_BE | UART_INT_PE | UART_INT_FE))
	{
    	UARTRxErrorClear(OSENS_UART_BASE);
    	buBufFlush();
    	flagErrorOccurred = 1;
        //while(UARTCharsAvail(OSENS_UART_BASE))
        //{
        //	dummy = UARTCharGetNonBlocking(OSENS_UART_BASE);
        //}
	}
    else if(ui32IntBm & (UART_INT_OE))
	{    //OVERRUN
    	UARTRxErrorClear(OSENS_UART_BASE);
        buBufFlush();
    	flagErrorOccurred = 1;
    	//dummy = UARTCharGetNonBlocking(OSENS_UART_BASE);
        //while(UARTCharsAvail(OSENS_UART_BASE))
        //{
        //	dummy = UARTCharGetNonBlocking(OSENS_UART_BASE);
        //}
	}
    else if(ui32IntBm & (UART_INT_RX | UART_INT_RT))
    {
        //
        // Put received bytes into buffer
        //
        //while(UARTCharsAvail(BSP_UART_BASE) && !BU_IS_BUF_FULL(&sBuBufRx))
        while(UARTCharsAvail(OSENS_UART_BASE))
        {
            buBufPushByte();
        }


        //if (ui32IntBm & UART_INT_RT)
        //{
        //	sm_state.frame_arrived = true;
        //}

    }
    else if(ui32IntBm & UART_INT_TX)
    {
        //while(UARTSpaceAvail(BSP_UART_BASE) && (!BU_IS_BUF_EMPTY(&sBuBufTx)))
        //{
        //    buBufPopByte();
        //}
    }
}

#if (SONOMA14 == 1)

// Metodo analitico generico.
// Passar o parametro 'int stype' com o valor 23 para S.23, 21 para S.21...
#if 0
float CalculaSType(uint8_t *paux, int stype){

	float retorno = 0;
	uint8_t auxbuf[3];
    uint8_t *rx= &auxbuf[0];
	int k;
	int j;
	int i;

	auxbuf[2]= *paux++;
	auxbuf[1]= *paux++;
	auxbuf[0]= *paux++;

	for (i = 1; i < 23; ++i)
	{
		if(i > 15){
			k = 2;
			j = 23 - i;
		} else
		if (i > 7){
			k = 1;
			j = 15 - i;
		} else {
			k = 0;
			j = 7 - i;
		}

		if(i< 24 - stype){
			retorno += rx[k] & (int)pow(2,j) ? 1/pow(2, (22 - stype)) : 0;

		} else {
			retorno += rx[k] & (int)pow(2,j) ? 1/pow(2,i) : 0;
		}

	}

	retorno = rx[0] & 128 ? (-1) * retorno : retorno; // Verifica o sinal

	return retorno;
}
#endif

// Deve ser passado o endereço do primeiro dos 3 bytes com valor.
float CalculaS21(uint8_t *paux)
{
	float retorno = 0;
	uint8_t auxbuf[3];
    uint8_t *rx= &auxbuf[0];

	auxbuf[2]= *paux++;
	auxbuf[1]= *paux++;
	auxbuf[0]= *paux++;

	retorno += rx[0] & 64 ? 2 : 0; // bit da posição 22
	retorno += rx[0] & 32 ? 1 : 0; // bit da posição 21
	retorno += rx[0] & 16 ? 0.5 : 0; // 1/2
	retorno += rx[0] & 8  ? 0.25 : 0; // 1/4
	retorno += rx[0] & 4  ? 0.125 : 0; // 1/8
	retorno += rx[0] & 2  ? 0.0625 : 0; // 1/16
	retorno += rx[0] & 1  ? 0.03125 : 0; // 1/32

	retorno += rx[1] & 128 ? 0.015625 : 0; // 1/64
	retorno += rx[1] & 64  ? 0.0078125 : 0; // 1/128
	retorno += rx[1] & 32  ? 0.00390625 : 0; // 1/256
	retorno += rx[1] & 16  ? 0.001953125 : 0; // 1/512
	retorno += rx[1] & 8   ? 0.0009765625 : 0; // 1/1024
	retorno += rx[1] & 4   ? 0.00048828125 : 0; // 1/2048
	retorno += rx[1] & 2   ? 0.000244140625 : 0; // 1/4096
	retorno += rx[1] & 1   ? 0.0001220703125 : 0; // 1/8192

	retorno += rx[2] & 128 ? 0.00006103515625 : 0; // 1/16384
	retorno += rx[2] & 64  ? 0.00003051757813 : 0; // 1/32768
	retorno += rx[2] & 32  ? 0.00001525878906 : 0; // 1/65536
	retorno += rx[2] & 16  ? 0.000007629394531 : 0; // 1/131072
	retorno += rx[2] & 8   ? 0.000003814697266 : 0; // 1/262144
	retorno += rx[2] & 4   ? 0.000001907348633 : 0; // 1/524288
	retorno += rx[2] & 2   ? 0.0000009536743164 : 0; // 1/1048576
	retorno += rx[2] & 1   ? 0.0000004768371582 : 0; // 1/2097152

	retorno = rx[0] & 128 ? (-1) * retorno : retorno; // Verifica o sinal

	return retorno;
}


float CalculaS23(uint8_t *paux)
{
	float retorno = 0;
	uint8_t auxbuf[3];
    uint8_t *rx= &auxbuf[0];

	auxbuf[2]= *paux++;
	auxbuf[1]= *paux++;
	auxbuf[0]= *paux++;

	retorno += rx[0] & 64 ? 0.5 : 0; // 1/2
	retorno += rx[0] & 32 ? 0.25 : 0; // 1/4
	retorno += rx[0] & 16 ? 0.125 : 0; // 1/8
	retorno += rx[0] & 8  ? 0.0625 : 0; // 1/16
	retorno += rx[0] & 4  ? 0.03125 : 0; // 1/32
	retorno += rx[0] & 2  ? 0.015625 : 0; // 1/64
	retorno += rx[0] & 1  ? 0.0078125 : 0; // 1/128

	retorno += rx[1] & 128 ? 0.00390625 : 0; // 1/256
	retorno += rx[1] & 64  ? 0.001953125 : 0; // 1/512
	retorno += rx[1] & 32  ? 0.0009765625 : 0; // 1/1024
	retorno += rx[1] & 16  ? 0.00048828125 : 0; // 1/2048
	retorno += rx[1] & 8   ? 0.000244140625 : 0; // 1/4096
	retorno += rx[1] & 4   ? 0.0001220703125 : 0; // 1/8192
	retorno += rx[1] & 2   ? 0.00006103515625 : 0; // 1/16384
	retorno += rx[1] & 1   ? 0.00003051757813 : 0; // 1/32768

	retorno += rx[2] & 128 ? 0.00001525878906 : 0; // 1/65536
	retorno += rx[2] & 64  ? 0.000007629394531 : 0; // 1/131072
	retorno += rx[2] & 32  ? 0.000003814697266 : 0; // 1/262144
	retorno += rx[2] & 16  ? 0.000001907348633 : 0; // 1/524288
	retorno += rx[2] & 8   ? 0.0000009536743164 : 0; // 1/1048576
	retorno += rx[2] & 4   ? 0.0000004768371582 : 0; // 1/2097152
	retorno += rx[2] & 2   ? 0.0000002384185791 : 0; // 1/4194304
	retorno += rx[2] & 1   ? 0.0000001192092896 : 0; // 1/8388608

	retorno = rx[0] & 128 ? (-1) * retorno : retorno; // Verifica o sinal

	return retorno;
}

uint32_t CalculaInt(uint8_t rx[])
{

	uint32_t retorno;

	retorno = rx[2] + (rx[1] << 8) + (rx[0] << 16);

	return retorno;
}

#endif

